-- phpMyAdmin SQL Dump
-- version 4.2.11
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Jun 15, 2018 at 04:32 PM
-- Server version: 5.6.21
-- PHP Version: 5.6.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `tpshop2_5`
--

-- --------------------------------------------------------

--
-- Table structure for table `nze_stock_log`
--

CREATE TABLE IF NOT EXISTS `nze_stock_log` (
`log_id` int(11) unsigned NOT NULL,
  `goods_id` int(11) DEFAULT NULL COMMENT '商品ID',
  `goods_name` varchar(100) DEFAULT NULL COMMENT '商品名称',
  `goods_spec` varchar(50) DEFAULT NULL COMMENT '商品规格',
  `order_sn` varchar(30) DEFAULT NULL COMMENT '订单编号',
  `user_id` int(11) DEFAULT NULL COMMENT '操作用户ID',
  `stock` int(11) DEFAULT NULL COMMENT '更改库存',
  `add_time` int(11) DEFAULT NULL COMMENT '操作时间'
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `nze_stock_log`
--

INSERT INTO `nze_stock_log` (`log_id`, `goods_id`, `goods_name`, `goods_spec`, `order_sn`, `user_id`, `stock`, `add_time`) VALUES
(1, 66, '迎馨家纺全棉斜纹印花双人四件套邂逅 AB版纯棉，亲肤透气', '', '201612010949401257', 1, -1, 1480556997),
(2, 119, '小米旗舰店正品手机平板通用迷你充电宝 移动电源10000毫安大容量', '颜色:土豪金', '201612161025174119', 1, -1, 1481855117),
(3, 66, '迎馨家纺全棉斜纹印花双人四件套邂逅 AB版纯棉，亲肤透气', '', '201612161028119836', 5766, -1, 1481855291),
(4, 66, '迎馨家纺全棉斜纹印花双人四件套邂逅 AB版纯棉，亲肤透气', '', '201612161031241561', 5766, -1, 1481855484),
(5, 76, '韩文2015冬装新款女装红色双排扣配腰带毛呢大衣.', '尺码:S', '201612161105085504', 5766, -1, 1481857521),
(6, 143, 'haier海尔 BC-93TMPF 93升单门冰箱', '', '201612161105085504', 5766, -1, 1481857521),
(7, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '', '', 1, -400, 1481876631),
(8, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612161650151656', 5791, -1, 1481880280),
(9, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612161845136060', 5801, -1, 1481885148),
(10, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612161848435822', 5801, -1, 1481885348),
(11, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612162230373370', 5801, -1, 1481898671),
(12, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612162236022245', 5801, -1, 1481898977),
(13, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612162311046965', 5811, -1, 1481901079),
(14, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612162337121884', 5812, -1, 1481902653),
(15, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612171414222559', 5825, -1, 1481955289),
(16, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612171427422246', 5825, -1, 1481956081),
(17, 143, 'haier海尔 BC-93TMPF 93升单门冰箱', '', '201612171440368583', 5826, -1, 1481956857),
(18, 141, '三星 Galaxy A9高配版 (A9100) 精灵黑 全网通4G手机 双卡双待', '颜色:黑色', '201612181200439163', 5648, -1, 1482033644),
(19, 140, 'Apple iPhone 6s 16GB 玫瑰金色 移动联通电信4G手机', '网络:4G 内存:16G 颜色:黑色', '201612191238465040', 5648, -2, 1482122327),
(20, 76, '韩文2015冬装新款女装红色双排扣配腰带毛呢大衣.', '尺码:S', '201612211646506770', 5952, -1, 1482804534),
(21, 136, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号', '合约套餐:乐享4G套餐99元', '201612271658536162', 1, -3, 1482829133),
(22, 116, 'ROMOSS/罗马仕 sense6 20000M毫安充电宝 正品手机通用移动电源', '颜色:土豪金', '201710201731512813', 3295, 1, 1508897050),
(23, 115, '爸爸2陆毅代言索扬20000毫安充电宝轻薄正品手机通用移动电源MAh', '颜色:土豪金', '201710201731512813', 3295, 1, 1508897050),
(24, 83, '力士精油香氛幽莲魅肤沐浴乳1000ml（新老包装随机发货）', '', '201710201738275937', 3295, 1, 1508897050),
(25, 79, '恒源祥秋冬新款男士纯色全羊毛衫 中年圆领长袖毛衣 加厚针织衫潮08W18096', '尺码:S', '201710201741532411', 3295, 1, 1508897050),
(26, 116, 'ROMOSS/罗马仕 sense6 20000M毫安充电宝 正品手机通用移动电源', '颜色:土豪金', '201710251010358493', 3295, 1, 1508897539),
(27, 143, 'haier海尔 BC-93TMPF 93升单门冰箱', '', '201710240947293602', 1, 1, 1508897623),
(28, 141, '三星 Galaxy A9高配版 (A9100) 精灵黑 全网通4G手机 双卡双待', '颜色:黑色', '201710240947293602', 1, 1, 1508897623),
(29, 130, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品', '', '201710240947293602', 1, 1, 1508897623),
(30, 141, '三星 Galaxy A9高配版 (A9100) 精灵黑 全网通4G手机 双卡双待', '颜色:黑色', '201610081700342175', 3448, 1, 1508926887),
(31, 142, '海尔（Haier）BCD-251WDGW 251升 无霜两门冰箱（白色）', '', '201710250937218116', 1, 1, 1509163909),
(32, 129, '【蚂蚁摄影】Canon/佳能 PowerShot SX410 IS 媲单反长焦数码相机', '', '201710250937218116', 1, 1, 1509163909),
(33, 127, 'Canon/佳能 EOS 70D套机(18-135mm)数码相机单反套机 苏宁易购', '', '201710250941068893', 1, 1, 1509163909),
(34, 124, 'Nikon/尼康D3300入门单反相机 升级版AF-P 18-55镜头套机 分期购', '', '201710250946523931', 1, 1, 1509163909),
(35, 117, '小派M-20000超薄充电宝适用MIUI蘋果6s手机通用毫安移动电源便携', '颜色:土豪金', '201710251036153254', 1, 1, 1509163909),
(36, 116, 'ROMOSS/罗马仕 sense6 20000M毫安充电宝 正品手机通用移动电源', '颜色:土豪金', '201710251121538057', 1, 1, 1509163909),
(37, 117, '小派M-20000超薄充电宝适用MIUI蘋果6s手机通用毫安移动电源便携', '颜色:土豪金', '201710251122343102', 1, 1, 1509163909),
(38, 117, '小派M-20000超薄充电宝适用MIUI蘋果6s手机通用毫安移动电源便携', '颜色:土豪金', '201710252226024274', 1, 1, 1509163909),
(39, 116, 'ROMOSS/罗马仕 sense6 20000M毫安充电宝 正品手机通用移动电源', '颜色:土豪金', '201710252226024274', 1, 1, 1509163909),
(40, 116, 'ROMOSS/罗马仕 sense6 20000M毫安充电宝 正品手机通用移动电源', '颜色:土豪金', '201710291851412153', 1, 1, 1509442926),
(41, 104, '小米手机5,十余项黑科技，很轻狠快', '内存:32G 颜色:黑色', '201711061650383645', 3677, 1, 1509958246),
(42, 143, 'haier海尔 BC-93TMPF 93升单门冰箱', '', '201711070919268608', 3678, 1, 1510017600),
(43, 104, '小米手机5,十余项黑科技，很轻狠快', '内存:32G 颜色:黑色', '201801311410134780', 1, 1, 1517379090),
(44, 143, 'haier海尔 BC-93TMPF 93升单门冰箱', NULL, '201712111512512950', 1, 1, 1522318080),
(45, 104, '小米手机5,十余项黑科技，很轻狠快', '内存:32G 颜色:黑色', '201801311409282905', 1, 1, 1522318080),
(46, 66, '迎馨家纺全棉斜纹印花双人四件套邂逅 AB版纯棉，亲肤透气', NULL, '201609191839424056', 2867, 1, 1528900024),
(47, 67, '迎馨家纺 全棉斜纹印花双人四件套 约定 桔色 1.5米床', NULL, '201609191839424056', 2867, 1, 1528900024),
(48, 76, '韩文2015冬装新款女装红色双排扣配腰带毛呢大衣.', '尺码:S', '201609191839424056', 2867, 1, 1528900024),
(49, 141, '三星 Galaxy A9高配版 (A9100) 精灵黑 全网通4G手机 双卡双待', '颜色:黑色', '201609181440479548', 2867, 1, 1528905316),
(50, 138, '广州电信卡|4G定制卡|含50话费|手机卡号码卡|上网卡流量卡靓号', '合约套餐:乐享4G套餐59元', '201806132359532709', 2867, 1, 1529033800);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `nze_stock_log`
--
ALTER TABLE `nze_stock_log`
 ADD PRIMARY KEY (`log_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `nze_stock_log`
--
ALTER TABLE `nze_stock_log`
MODIFY `log_id` int(11) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=51;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
