-- phpMyAdmin SQL Dump
-- version 4.2.11
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Jun 15, 2018 at 04:54 PM
-- Server version: 5.6.21
-- PHP Version: 5.6.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `tpshop2_5`
--

-- --------------------------------------------------------

--
-- Table structure for table `nze_flash_sale`
--

CREATE TABLE IF NOT EXISTS `nze_flash_sale` (
`sale_id` bigint(10) NOT NULL,
  `title` varchar(200) NOT NULL DEFAULT '' COMMENT '活动标题',
  `goods_id` int(10) NOT NULL COMMENT '参团商品ID',
  `item_id` bigint(20) DEFAULT '0' COMMENT '对应spec_goods_price商品规格id',
  `price` float(10,2) NOT NULL COMMENT '活动价格',
  `goods_num` int(10) DEFAULT '1' COMMENT '商品参加活动数',
  `buy_limit` int(11) NOT NULL DEFAULT '1' COMMENT '每人限购数',
  `buy_num` int(11) NOT NULL DEFAULT '0' COMMENT '已购买人数',
  `order_num` int(10) DEFAULT '0' COMMENT '已下单数',
  `sale_desc` text COMMENT '活动描述',
  `start_time` int(11) NOT NULL COMMENT '开始时间',
  `end_time` int(11) NOT NULL COMMENT '结束时间',
  `is_end` tinyint(1) DEFAULT '0' COMMENT '是否已结束',
  `goods_name` varchar(255) DEFAULT NULL COMMENT '商品名称'
) ENGINE=InnoDB AUTO_INCREMENT=66 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `nze_flash_sale`
--

INSERT INTO `nze_flash_sale` (`sale_id`, `title`, `goods_id`, `item_id`, `price`, `goods_num`, `buy_limit`, `buy_num`, `order_num`, `sale_desc`, `start_time`, `end_time`, `is_end`, `goods_name`) VALUES
(1, '520闪购', 119, 0, 59.00, 50, 1, 20, 18, '电视广告的风格', 1486454400, 1486461600, 1, '小米旗舰店正品手机平板通用迷你充电宝 移动电源10000毫安大容量'),
(9, '靓号0元送广东联通4G/3G手机卡上网卡', 136, 0, 50.00, 50, 3, 0, 0, '', 1486454400, 1517997600, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号'),
(10, '三星 Galaxy A9高配版 (A9100) 精灵黑 全网通4G手机 双卡双待', 141, 0, 3400.00, 100, 10, 0, 0, '三星 Galaxy A9高配版 (A9100) 精灵黑 全网通4G手机 双卡双待', 1486454400, 1517997600, 0, '三星 Galaxy A9高配版 (A9100) 精灵黑 全网通4G手机 双卡双待'),
(11, '520闪购', 119, 0, 59.00, 50, 1, 0, 0, '电视广告的风格', 1501689600, 1581156000, 0, '小米旗舰店正品手机平板通用迷你充电宝 移动电源10000毫安大容量'),
(12, 'Canon/佳能 EOS 700D套机', 126, 0, 3499.00, 10, 1, 0, 0, 'Canon/佳能 EOS 700D套机（18-55mm)数码单反相机 苏宁易购', 1486787210, 1555084799, 0, 'Canon/佳能 EOS 700D套机（18-55mm)数码单反相机 苏宁易购'),
(13, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, '', 1509962400, 1509969600, 1, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(14, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, '秒杀尼康', 1509962400, 1509969600, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(15, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, '', 1509962400, 1509969600, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(16, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, '', 1509962400, 1509969600, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(21, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1509969601, 1509976799, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(22, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1509969601, 1509976799, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(23, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1509969601, 1509976799, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(24, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1509969601, 1509976799, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(25, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1509976800, 1509983999, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(26, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1509976800, 1509983999, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(27, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1509976800, 1509983999, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(28, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1509976800, 1509983999, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(29, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1509897600, 1509904799, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(30, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1509897600, 1509904799, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(31, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1509897600, 1509904799, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(32, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1509897600, 1509904799, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(33, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1509904800, 1509911999, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(34, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1509904800, 1509911999, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(35, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1509904800, 1509911999, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(36, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1509904800, 1509911999, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(37, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1509912000, 1509919199, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(38, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1509912000, 1509919199, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(39, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1509912000, 1509919199, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(40, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1509912000, 1509919199, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(41, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1509919200, 1509926399, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(42, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1509919200, 1509926399, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(43, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1509919200, 1509926399, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(44, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1509919200, 1509926399, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(45, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1509926400, 1509933599, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(46, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1509926400, 1509933599, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(47, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1509926400, 1509933599, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(48, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1509926400, 1509933599, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(49, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1510012800, 1510020000, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(50, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1510012800, 1510020000, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(51, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1510012800, 1510020000, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(52, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1510012800, 1510020000, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(53, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1510020000, 1510027200, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(54, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1510020000, 1510027200, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(55, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1510020000, 1510027200, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(56, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1510020000, 1510027200, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(57, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1510027200, 1510034400, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(58, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1510027200, 1510034400, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(59, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1510027200, 1510034400, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(60, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1510027200, 1510034400, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(61, '秒杀三星', 136, 210, 50.00, 20, 1, 0, 0, NULL, 1510034400, 1510041600, 0, '靓号0元送广东联通4G/3G手机卡上网卡大流量套餐全国无漫游选号合约套餐:乐享4G套餐99元'),
(62, '秒杀尼康', 130, 0, 1000.00, 20, 1, 0, 0, NULL, 1510034400, 1510041600, 0, 'Nikon/尼康 D7200套机(18-140mm) 尼康D7200 单反相机 正品'),
(63, '秒杀小米', 120, 190, 99.00, 20, 1, 0, 0, NULL, 1510034400, 1510041600, 0, '小米旗舰店正品手机平板通用移动电源16000毫安大容量品牌充电宝颜色:土豪金'),
(64, '秒杀西门子', 113, 0, 5000.00, 20, 1, 0, 0, NULL, 1510034400, 1510041600, 0, 'SIEMENS/西门子 KA92NV09TI双开门家用对开门电冰箱变频旗舰款'),
(65, 'qingg ', 141, 212, 19.00, 3, 2, 0, 0, '334', 1510041600, 1510048800, 1, '三星 Galaxy A9高配版 (A9100) 精灵黑 全网通4G手机 双卡双待颜色:白色');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `nze_flash_sale`
--
ALTER TABLE `nze_flash_sale`
 ADD PRIMARY KEY (`sale_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `nze_flash_sale`
--
ALTER TABLE `nze_flash_sale`
MODIFY `sale_id` bigint(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=66;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
